const WEAPON_BUFFS_CONFIG = {
  "14137": { // 仪玄专武：青溟笼舍
    "self_buffs": [
      {
        "id": "weapon_14137_passive",
        "name": "青溟笼舍",
        "desc": "云流运转-暴击率提升20%；装备者释放[强化特殊技]时角色获得1层[青溟同行]效果，最多叠加2层，持续15秒，进入接战状态时直接获得2层，重复触发时刷新持续时间；每层[青溟同行]效果使装备者造成的以太伤害提升8%，[终结技]或[强化特殊技]造成的以太贯穿伤害提升10%。",
        "active": true,
        // 精炼 1-5 阶的暴击率
        "crit_rate": [20.0, 23.0, 26.0, 29.0, 32.0],
        // 精炼 1-5 阶的属性伤害
        "attribute_dmg": [16.0, 18.4, 20.8, 23.2, 25.6],
        "tags": ["ether", "以太"],
        // 精炼 1-5 阶的穿透伤害加成
        "pen_dmg_bonus": [20.0, 23.0, 26.0, 29.0, 32.0],
        "tags": ["ether", "以太"]
      }
    ],
    "team_buffs": []
  },
  "14140": { // 爱丽丝专武：十方锻星
    "self_buffs": [
      {
        "id": "weapon_14140_passive",
        "name": "十方锻星",
        "desc": "予你星屑-装备者的[异常掌控]提升60点；触发[强击]时，装备者造成的物理伤害提升20%，持续20秒，最多叠加2层，重复触发时刷新持续时间，装备者进入接战状态时，立即获得2层效果。",
        "active": true,
        "anomaly_mastery": [60, 69, 78, 87, 96],
        "dmg_bonus": [40, 46, 52, 58, 64],
        "tags": ["physical", "物理"]
      }
    ],
    "team_buffs": []
  }
};